
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элемент = Задания.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Элемент.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Элемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Лекция");
	Элемент.ПравоеЗначение = Объект.Ссылка;
	Элемент.Использование = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура НеИспользуетсяНужноУдалитьПослеПроверки()
	
	// Эта процедура не используется, ее нужно удалить целмком после проверки.
	
КонецПроцедуры
